using MongoDB.Bson.Serialization.Attributes;
using MongoDB.Bson;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Data;
using System.Xml.Linq;

namespace Application
{
    public class Materials
    {
        [BsonId]
        [BsonRepresentation(BsonType.ObjectId)]
        public string Id { get; set; }
        public string Title { get; set; }
        public string MaterialContent { get; set; }
        public int ClassName { get; set; }
        public int NumberOfTheme { get; set; }

        public Materials()
        {
            NumberOfTheme = 3;
            ClassName = 7;
            Title = "Правила роботи в хімічному кабінеті. Лабораторний посуд і обладнання";
            MaterialContent = "Ви вже знаєте, що хімія — наука про речовини та їх перетворення. Учені хіміки здійснюють різноманітні експерименти з речовинами в хімічних лабораторіях, використовують сучасне обладнання, складні прилади.\nУроки хімії відбуваються в хімічному кабінеті, оснащеному витяжною шафою. У ній виконують досліди, під час яких виділяються гази з різким, неприємним запахом.\nВи працюватимете з багатьма речовинами. Деякі з них можуть спричинити запаморочення, отруєння, опіки, а легкозаймисті — пожежу. Тому з такими речовинами треба поводитися дуже обережно, пам’ятати, де в хімічному кабінеті знаходяться аптечка і протипожежні засоби.\nКожному учневі потрібно знати правила роботи в хімічному кабінеті та їх дотримуватися. Для того щоб успішно здійснювати хімічні експерименти, потрібно знати основні види лабораторного посуду та обладнання, а також уміти ними користуватися.\nЛабораторний посуд. Більшість посуду для хімічних дослідів зроблено зі скла, решта — із порцеляни або пластмаси. Працюючи зі скляним посудом, треба пам’ятати, що він легко розбивається і може тріскати під час нагрівання. Порцеляновий посуд призначений для нагрівання, розтирання твердих речовин; він термостійкіший і міцніший за скляний.\nУ хімічній лабораторії всі речовини та їхні розчини містяться в щільно закритих банках і пляшках. Їх відкривають тільки для того, щоб узяти необхідну порцію речовини або розчину, а потім закривають. Кришки і пробки кладуть на стіл зовнішньою поверхнею.\nВідбір твердої речовини із банки здійснюють ложечкою або шпателем. Певний об’єм рідини відбирають піпеткою або за допомогою мірного циліндра.\nДля подрібнення часточок твердої речовини використовують порцелянову ступку з товкачиком.\n";
        }
    }
}
