using MongoDB.Bson.Serialization.Attributes;
using MongoDB.Bson;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Data;
using System.Xml.Linq;

namespace Application
{
    public class Materials
    {
        [BsonId]
        [BsonRepresentation(BsonType.ObjectId)]
        public string Id { get; set; }
        public string Title { get; set; }
        public string MaterialContent { get; set; }
        public int ClassName { get; set; }
        public int NumberOfTheme { get; set; }
        public Materials(string title, string materialContent, int className, int numberOfTheme)
        {
            ClassName = className;
            NumberOfTheme = numberOfTheme;
            Title = title;
            MaterialContent = materialContent;
        }

        public Materials(string id, string title, string materialContent, int className, int numberOfTheme)
        {
            Id = id;
            Title = title;
            MaterialContent = materialContent;
            ClassName = className;
            NumberOfTheme = numberOfTheme;
        }
        public Materials()
        {
            ClassName = 7;
            NumberOfTheme = 6;
            Title = "Лужні елементи, галогени та інертні елементи";
            MaterialContent = "\tЛужні елементи — це найактивніші металічні елементи, вони\r\nрозміщені в І групі Періодичної системи.\r\n\tПрості речовини метали, утворені цими елементами, також називають лужними.\r\nВони значно легші за інші метали (залізо, мідь, алюміній), дуже м’які, їх можна різати\r\nножем.\r\nЛужні метали мають найяскравіше виявлені металічні властивості: вони вступають у реакції з киснем, водою й кислотами. Їх взаємодія з водою відбувається дуже активно, іноді з вибухом.\r\nГідроксиди лужних елементів — розчинні основи (луги) із загальною формулою ROH, де R — будь-який із лужних елементів.\r\n\t\tГідроксиди Рубідію й Цезію такі активні, що їх концентровані розчини легко руйнують скло навіть за кімнатної температури, а розплави — залізо й навіть платину.\r\nЛужні елементи утворюють оксиди із загальною формулою R2O: 4Li+O2  =  2Li2O.\r\nЛужні метали настільки активні, що трапляються в природі виключно у вигляді сполук. Добувають їх зазвичай дією електричного струму на їхні сполуки. Натрій і калій уперше були добуті Майклом Фарадеєм саме в такий спосіб. \r\nГалогени — це найактивніші неметалічні елементи, вони розміщені в VII групі Періодичної системи.\r\nДля елементів-галогенів також\r\nхарактерні спільні властивості, зокрема, у сполуках усі вони здатні\r\nвиявляти валентність I.\r\n\tПрості речовини, утворені цими елементами, також називають галогенами. Галогени є речовинами молекулярної будови, молекули яких складаються з двох атомів: F2,Cl2, Br2, I2.\r\n\t\tГалогени — найактивніші неметали. Вони реагують із багатьма\r\nречовинами. А в атмосфері фтору навіть вода здатна горіти: \r\n2F2+H2O  =  2HF+OF2\r\n\tІз воднем галогени також взаємодіють дуже активно, іноді з вибухом. Результатом реакції є леткі сполуки з Гідрогеном загального\r\nскладу HR, водні розчини яких є кислотами: H2+F2  =  2HF    H2+Cl2  =  2HCl\r\n\tГалогени активно реагують із металами. Продуктами таких реакцій є солі — галогеніди (флуориди, хлориди, броміди, йодиди):   Mg+Cl2  =  MgCl2 \r\n 2Al+3Br2  =  2AlBr3\r\n\tСаме завдяки властивості утворювати солі ці елементи й назвали галогенами (від грец. галос — сіль).\r\n\tІнертні елементи\r\n\tЩе одну родину утворюють елементи VIII групи Періодичної системи. Їх називають інертними елементами.\r\n\tПрості речовини цих елементів називають інертними (благородними) газами, вони складаються з одноатомних молекул.\r\nУсі вони за звичайних умов є газами, які в незначних кількостях містяться в повітрі.\r\nДонедавна вважали, що інертні гази взагалі не утворюють хімічних сполук (про що свідчить їхня назва). Однак за останні декілька десятиліть ауковцям удалося добути багато сполук Криптону, Ксенону й Радону з Оксигеном та Флуором.\r\nНайлегший з інертних елементів — Гелій — був першим хімічним елементом, виявленим поза Землею. Аналізуючи випромінювання Сонця за допомогою спектрального аналізу, П’єр Жансан 1868 року виявив світіння, не характерне для жодного з відомих на той час елементів. Саме тому цей елемент був названий Гелієм (від грец. геліос — сонце). Певна річ, складно відкрити елементи, які не утворюють сполук, але після \r\nідкриття Гелію науковці почали ретельніше вивчати гази й незабаром відкрили всі інертні елементи.";
        }
    }
}
