using MongoDB.Bson.Serialization.Attributes;
using MongoDB.Bson;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Data;
using System.Xml.Linq;

namespace Application
{
    public class Materials
    {
        [BsonId]
        [BsonRepresentation(BsonType.ObjectId)]
        public string Id { get; set; }
        public string Title { get; set; }
        public string MaterialContent { get; set; }
        public int ClassName { get; set; }

        public Materials()
        {
            ClassName = 7;
            Title = "Хімія — природнича наука";
            MaterialContent = "Слово «хімія» має кілька значень. Хімією називають одну з наук, а також навчальний предмет у школі, університеті. Іноді це слово вживають як скорочену назву хімічної промисловості. Хімія — природнича наука. На уроках природознавства ви дізналися, що існує кілька наук про природу. Серед них є й хімія. У різні часи вчені здійснювали багато експериментів із речовинами і намагалися зрозуміти явища, які спостерігали. Вони висували різні гіпотези, створювали теорії, які перевіряли під час нових дослідів.Нині, вивчаючи речовини — як природні,так і добуті в лабораторіях, — хіміки визначають їхній склад і внутрішню будову, досліджують властивості, пропонують сфери їх використання. Завдяки досягненням учених розвиваються промисловість, техніка, медицина, зростає рівень життя людей. Речовини та їх перетворення в навколишньому світі. Речовини є всюди — в повітрі, природній воді, ґрунті, живих організмах. Вони поширені не лише на Землі, а й на інших планетах.У природі кожної миті відбуваються перетворення речовин. Так, живі істоти при диханні споживають частину кисню, що є в повітрі, а видихають повітря з підвищеним вмістом вуглекислого газу. Цей газ виділяється під час пожеж, гниття і розкладання решток рослин, тварин. Зелене листя вбирає вуглекислий газ і воду, які перетворюються в рослинах на органічні речовини та кисень, що надходить в атмосферу. У надрах планети протягом мільйонів років утворювалися різні мінерали, нафта, природний газ, вугілля. Безліч хімічних процесів відбувається в річках, морях і океанах. Людина щодня здійснює перетворення речовин, навіть не здогадуючись про це.";
        }
    }
}
